Revit 2027 API
StructuralAsset Constructor
 Constructs an instance of StructuralAsset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralAsset(
	string name,
	StructuralAssetClass structuralAssetClass
)
Public Sub New (
	name As String,
	structuralAssetClass As StructuralAssetClass
)
public:
StructuralAsset(
	String^ name,
	StructuralAssetClass structuralAssetClass
)
new :
        name : string *
        structuralAssetClass : StructuralAssetClass -> StructuralAsset
Parameters
name String
 The name of the asset.
structuralAssetClass StructuralAssetClass
 The type of structural material that this asset will describe.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
StructuralAsset Class
Autodesk.Revit.DB Namespace